int M = 1;
int N = 10;
Lib .hideIt("Задача 1: Задайте значения M и N. Напишите программу, которая выведет все натуральные числа в промежутке от M до N");
Lib.taskOne(M, N); 
Lib .hideIt("Задача 2: Задайте значения M и N. Напишите программу, которая найдёт сумму натуральных элементов в промежутке от M до N.");
System.Console.WriteLine( Lib.taskTwo(M, N));
Lib .hideIt("Задача 3: Напишите программу вычисления функции Аккермана с помощью рекурсии. Даны два неотрицательных числа m и n. ");

System.Console.WriteLine(Lib .akMan (3,2));